## Plan for org_account/iam_identity_center
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 13 to add, 0 to change, 11 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                              NAME                                               |
|--------|-------------------------------------------------------------------------------------------------|
| add    | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Admin-Pinpoint-SMS&quot;]`     |
|        | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Admin-S3-WebsiteAssets&quot;]` |
|        | `aws_ssoadmin_account_assignment.notify_production[&quot;Notify-Production-Admin-SupportCenter&quot;]`    |
|        | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-Admin-Pinpoint-SMS&quot;]`           |
|        | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-Admin-S3-WebsiteAssets&quot;]`       |
|        | `aws_ssoadmin_account_assignment.notify_staging[&quot;Notify-Staging-Admin-SupportCenter&quot;]`          |
|        | `aws_ssoadmin_permission_set.admin_pinpoint_sms`                                                |
|        | `aws_ssoadmin_permission_set_inline_policy.access_quicksight`                                   |
|        | `aws_ssoadmin_permission_set_inline_policy.admin_pinpoint_sms`                                  |
|        | `aws_ssoadmin_permission_set_inline_policy.admin_s3_website_assets`                             |
|        | `aws_ssoadmin_permission_set_inline_policy.notify_access_ecs_blazer`                            |
|        | `aws_ssoadmin_permission_set_inline_policy.read_only_billing`                                   |
|        | `aws_ssoadmin_permission_set_inline_policy.remove_ses_sns_suppressed`                           |
| delete | `aws_iam_policy.access_quicksight`                                                              |
|        | `aws_iam_policy.admin_pointpoint_sms`                                                           |
|        | `aws_iam_policy.admin_s3_website_assets`                                                        |
|        | `aws_iam_policy.read_only_billing`                                                              |
|        | `aws_iam_policy.remove_ses_sns_suppressed`                                                      |
|        | `aws_ssoadmin_customer_managed_policy_attachment.access_quicksight`                             |
|        | `aws_ssoadmin_customer_managed_policy_attachment.admin_pointpoint_sms`                          |
|        | `aws_ssoadmin_customer_managed_policy_attachment.admin_s3_website_assets`                       |
|        | `aws_ssoadmin_customer_managed_policy_attachment.read_only_billing`                             |
|        | `aws_ssoadmin_customer_managed_policy_attachment.remove_ses_sns_suppressed`                     |
|        | `aws_ssoadmin_permission_set.admin_pointpoint_sms`                                              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.access_quicksight will be destroyed
  # (because aws_iam_policy.access_quicksight is not in configuration)
  - resource "aws_iam_policy" "access_quicksight" {
      - arn         = "arn:aws:iam::659087519042:policy/identity-center/Access-QuickSight" -> null
      - description = "Grants access to QuickSight." -> null
      - id          = "arn:aws:iam::659087519042:policy/identity-center/Access-QuickSight" -> null
      - name        = "Access-QuickSight" -> null
      - path        = "/identity-center/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "quicksight:UpdateFolderMembership",
                          - "quicksight:UpdateFolder",
                          - "quicksight:UpdateDataSet",
                          - "quicksight:UpdateDashboard",
                          - "quicksight:UpdateAnalysis",
                          - "quicksight:UntagResource",
                          - "quicksight:TagResource",
                          - "quicksight:Search*",
                          - "quicksight:RestoreAnalysis",
                          - "quicksight:Pass*",
                          - "quicksight:List*",
                          - "quicksight:Get*",
                          - "quicksight:Describe*",
                          - "quicksight:DeleteFolderMembership",
                          - "quicksight:DeleteFolder",
                          - "quicksight:DeleteDataSet",
                          - "quicksight:DeleteDashboard",
                          - "quicksight:DeleteAnalysis",
                          - "quicksight:CreateFolderMembership",
                          - "quicksight:CreateFolder",
                          - "quicksight:CreateDataSet",
                          - "quicksight:CreateDashboard",
                          - "quicksight:CreateAnalysis",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "QuickSightAccess"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAZS5FNNVBBCRAZJJXJ" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # aws_iam_policy.admin_pointpoint_sms will be destroyed
  # (because aws_iam_policy.admin_pointpoint_sms is not in configuration)
  - resource "aws_iam_policy" "admin_pointpoint_sms" {
      - arn         = "arn:aws:iam::659087519042:policy/identity-center/Admin-Pinpoint-SMS" -> null
      - description = "Full access to Pointpoint SMS Voice." -> null
      - id          = "arn:aws:iam::659087519042:policy/identity-center/Admin-Pinpoint-SMS" -> null
      - name        = "Admin-Pinpoint-SMS" -> null
      - path        = "/identity-center/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sns:ListTopics",
                          - "ses:List*",
                          - "ses:Get*",
                          - "ses:Describe*",
                          - "s3:List*",
                          - "mobiletargeting:List*",
                          - "mobiletargeting:Get*",
                          - "kinesis:ListStreams",
                          - "iam:ListRoles",
                          - "firehose:ListDeliveryStreams",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "DataRead"
                    },
                  - {
                      - Action   = "sms-voice:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "SMSVoiceFullAccess"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAZS5FNNVBME6UU7N2P" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # aws_iam_policy.admin_s3_website_assets will be destroyed
  # (because aws_iam_policy.admin_s3_website_assets is not in configuration)
  - resource "aws_iam_policy" "admin_s3_website_assets" {
      - arn         = "arn:aws:iam::659087519042:policy/identity-center/notify/Admin-S3-WebsiteAssets" -> null
      - description = "Grants ability to manage the Notify S3 website assets." -> null
      - id          = "arn:aws:iam::659087519042:policy/identity-center/notify/Admin-S3-WebsiteAssets" -> null
      - name        = "Admin-S3-WebsiteAssets" -> null
      - path        = "/identity-center/notify/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListAllMyBuckets",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ListAllOwnedS3Buckets"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::notification-canada-ca-staging-asset-upload",
                          - "arn:aws:s3:::notification-canada-ca-production-asset-upload",
                          - "arn:aws:s3:::notification-alpha-canada-ca-asset-upload",
                        ]
                      - Sid      = "ListS3AssetBuckets"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::notification-canada-ca-staging-asset-upload/*",
                          - "arn:aws:s3:::notification-canada-ca-production-asset-upload/*",
                          - "arn:aws:s3:::notification-alpha-canada-ca-asset-upload/*",
                        ]
                      - Sid      = "AdminS3AssetBucketObjects"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAZS5FNNVBKE4CHNK2P" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # aws_iam_policy.read_only_billing will be destroyed
  # (because aws_iam_policy.read_only_billing is not in configuration)
  - resource "aws_iam_policy" "read_only_billing" {
      - arn         = "arn:aws:iam::659087519042:policy/identity-center/ReadOnly-Billing" -> null
      - description = "Read-only access to Billing and Cost Explorer." -> null
      - id          = "arn:aws:iam::659087519042:policy/identity-center/ReadOnly-Billing" -> null
      - name        = "ReadOnly-Billing" -> null
      - path        = "/identity-center/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "billing:List*",
                          - "billing:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "BillingRead"
                    },
                  - {
                      - Action   = [
                          - "ce:List*",
                          - "ce:Get*",
                          - "ce:Describe*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CostExplorerRead"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAZS5FNNVBK6ZAJR7PF" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # aws_iam_policy.remove_ses_sns_suppressed will be destroyed
  # (because aws_iam_policy.remove_ses_sns_suppressed is not in configuration)
  - resource "aws_iam_policy" "remove_ses_sns_suppressed" {
      - arn         = "arn:aws:iam::659087519042:policy/identity-center/Remove-SES-SNS-Suppressed" -> null
      - description = "Remove SES and SNS suppressed phone numbers and email addresses." -> null
      - id          = "arn:aws:iam::659087519042:policy/identity-center/Remove-SES-SNS-Suppressed" -> null
      - name        = "Remove-SES-SNS-Suppressed" -> null
      - path        = "/identity-center/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ses:List*",
                          - "ses:Get*",
                          - "ses:DeleteSuppressedDestination",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "SESReadAndDeleteSuppressed"
                    },
                  - {
                      - Action   = [
                          - "sns:OptInPhoneNumber",
                          - "sns:ListPhoneNumbersOptedOut",
                          - "sns:CheckIfPhoneNumberIsOptedOut",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "SNSListAndDeleteOptedOutNumbers"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAZS5FNNVBM3R3LSBIM" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Admin-Pinpoint-SMS"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = "3ccd2518-e051-705f-476c-e4db031b1b31"
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Admin-S3-WebsiteAssets"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c23ca3987a09602f"
      + principal_id       = "3cdd8588-b001-7075-e6af-075e708ac27c"
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Admin-SupportCenter"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-7a9fcd184d647af8"
      + principal_id       = "bcfd35b8-3031-70ab-179a-5d746590354f"
      + principal_type     = "GROUP"
      + target_id          = "296255494825"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Admin-Pinpoint-SMS"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = "6cfd2548-f071-70e7-cf44-6ad379410b49"
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Admin-S3-WebsiteAssets"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c23ca3987a09602f"
      + principal_id       = "dc0de538-e0d1-70a9-0a9a-857046dcccaa"
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Admin-SupportCenter"] will be created
  + resource "aws_ssoadmin_account_assignment" "notify_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-7a9fcd184d647af8"
      + principal_id       = "1c4d9558-a031-7021-70cf-c90a701d4fef"
      + principal_type     = "GROUP"
      + target_id          = "239043911459"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_customer_managed_policy_attachment.access_quicksight will be destroyed
  # (because aws_ssoadmin_customer_managed_policy_attachment.access_quicksight is not in configuration)
  - resource "aws_ssoadmin_customer_managed_policy_attachment" "access_quicksight" {
      - id                 = "Access-QuickSight,/identity-center/,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf" -> null

      - customer_managed_policy_reference {
          - name = "Access-QuickSight" -> null
          - path = "/identity-center/" -> null
        }
    }

  # aws_ssoadmin_customer_managed_policy_attachment.admin_pointpoint_sms will be destroyed
  # (because aws_ssoadmin_customer_managed_policy_attachment.admin_pointpoint_sms is not in configuration)
  - resource "aws_ssoadmin_customer_managed_policy_attachment" "admin_pointpoint_sms" {
      - id                 = "Admin-Pinpoint-SMS,/identity-center/,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-ca4248f9f269617f,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-ca4248f9f269617f" -> null

      - customer_managed_policy_reference {
          - name = "Admin-Pinpoint-SMS" -> null
          - path = "/identity-center/" -> null
        }
    }

  # aws_ssoadmin_customer_managed_policy_attachment.admin_s3_website_assets will be destroyed
  # (because aws_ssoadmin_customer_managed_policy_attachment.admin_s3_website_assets is not in configuration)
  - resource "aws_ssoadmin_customer_managed_policy_attachment" "admin_s3_website_assets" {
      - id                 = "Admin-S3-WebsiteAssets,/identity-center/notify/,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c23ca3987a09602f,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c23ca3987a09602f" -> null

      - customer_managed_policy_reference {
          - name = "Admin-S3-WebsiteAssets" -> null
          - path = "/identity-center/notify/" -> null
        }
    }

  # aws_ssoadmin_customer_managed_policy_attachment.read_only_billing will be destroyed
  # (because aws_ssoadmin_customer_managed_policy_attachment.read_only_billing is not in configuration)
  - resource "aws_ssoadmin_customer_managed_policy_attachment" "read_only_billing" {
      - id                 = "ReadOnly-Billing,/identity-center/,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c9084467f2ed3090,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c9084467f2ed3090" -> null

      - customer_managed_policy_reference {
          - name = "ReadOnly-Billing" -> null
          - path = "/identity-center/" -> null
        }
    }

  # aws_ssoadmin_customer_managed_policy_attachment.remove_ses_sns_suppressed will be destroyed
  # (because aws_ssoadmin_customer_managed_policy_attachment.remove_ses_sns_suppressed is not in configuration)
  - resource "aws_ssoadmin_customer_managed_policy_attachment" "remove_ses_sns_suppressed" {
      - id                 = "Remove-SES-SNS-Suppressed,/identity-center/,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-7a9fcd184d647af8,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-7a9fcd184d647af8" -> null

      - customer_managed_policy_reference {
          - name = "Remove-SES-SNS-Suppressed" -> null
          - path = "/identity-center/" -> null
        }
    }

  # aws_ssoadmin_permission_set.admin_pinpoint_sms will be created
  + resource "aws_ssoadmin_permission_set" "admin_pinpoint_sms" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = "Grants full access to Pinpoint SMS Voice."
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + name             = "Admin-Pinpoint-SMS"
      + session_duration = "PT1H"
      + tags_all         = (known after apply)
    }

  # aws_ssoadmin_permission_set.admin_pointpoint_sms will be destroyed
  # (because aws_ssoadmin_permission_set.admin_pointpoint_sms is not in configuration)
  - resource "aws_ssoadmin_permission_set" "admin_pointpoint_sms" {
      - arn              = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-ca4248f9f269617f" -> null
      - created_date     = "2024-05-09T18:55:57Z" -> null
      - description      = "Grants full access to Pinpoint SMS Voice." -> null
      - id               = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-ca4248f9f269617f,arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - instance_arn     = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452" -> null
      - name             = "Admin-Pinpoint-SMS" -> null
      - session_duration = "PT1H" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
    }

  # aws_ssoadmin_permission_set_inline_policy.access_quicksight will be created
  + resource "aws_ssoadmin_permission_set_inline_policy" "access_quicksight" {
      + id                 = (known after apply)
      + inline_policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "quicksight:UpdateFolderMembership",
                          + "quicksight:UpdateFolder",
                          + "quicksight:UpdateDataSet",
                          + "quicksight:UpdateDashboard",
                          + "quicksight:UpdateAnalysis",
                          + "quicksight:UntagResource",
                          + "quicksight:TagResource",
                          + "quicksight:Search*",
                          + "quicksight:RestoreAnalysis",
                          + "quicksight:Pass*",
                          + "quicksight:List*",
                          + "quicksight:Get*",
                          + "quicksight:Describe*",
                          + "quicksight:DeleteFolderMembership",
                          + "quicksight:DeleteFolder",
                          + "quicksight:DeleteDataSet",
                          + "quicksight:DeleteDashboard",
                          + "quicksight:DeleteAnalysis",
                          + "quicksight:CreateFolderMembership",
                          + "quicksight:CreateFolder",
                          + "quicksight:CreateDataSet",
                          + "quicksight:CreateDashboard",
                          + "quicksight:CreateAnalysis",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "QuickSightAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-cb5875ffc2474abf"
    }

  # aws_ssoadmin_permission_set_inline_policy.admin_pinpoint_sms will be created
  + resource "aws_ssoadmin_permission_set_inline_policy" "admin_pinpoint_sms" {
      + id                 = (known after apply)
      + inline_policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sns:ListTopics",
                          + "ses:List*",
                          + "ses:Get*",
                          + "ses:Describe*",
                          + "s3:List*",
                          + "mobiletargeting:List*",
                          + "mobiletargeting:Get*",
                          + "kinesis:ListStreams",
                          + "iam:ListRoles",
                          + "firehose:ListDeliveryStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DataRead"
                    },
                  + {
                      + Action   = "sms-voice:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SMSVoiceFullAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
    }

  # aws_ssoadmin_permission_set_inline_policy.admin_s3_website_assets will be created
  + resource "aws_ssoadmin_permission_set_inline_policy" "admin_s3_website_assets" {
      + id                 = (known after apply)
      + inline_policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListAllMyBuckets",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ListAllOwnedS3Buckets"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::notification-canada-ca-staging-asset-upload",
                          + "arn:aws:s3:::notification-canada-ca-production-asset-upload",
                          + "arn:aws:s3:::notification-alpha-canada-ca-asset-upload",
                        ]
                      + Sid      = "ListS3AssetBuckets"
                    },
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::notification-canada-ca-staging-asset-upload/*",
                          + "arn:aws:s3:::notification-canada-ca-production-asset-upload/*",
                          + "arn:aws:s3:::notification-alpha-canada-ca-asset-upload/*",
                        ]
                      + Sid      = "AdminS3AssetBucketObjects"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c23ca3987a09602f"
    }

  # aws_ssoadmin_permission_set_inline_policy.notify_access_ecs_blazer will be created
  + resource "aws_ssoadmin_permission_set_inline_policy" "notify_access_ecs_blazer" {
      + id                 = (known after apply)
      + inline_policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:StartSession"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:ca-central-1::document/AWS-StartPortForwardingSession",
                          + "arn:aws:ecs:ca-central-1:*:task/blazer/*",
                        ]
                      + Sid      = "SSMSessionStartBlazer"
                    },
                  + {
                      + Action   = [
                          + "ssm:TerminateSession",
                          + "ssm:ResumeSession",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SSMSessionManage"
                    },
                  + {
                      + Action    = [
                          + "ecs:ListTasks",
                          + "ecs:DescribeTasks",
                        ]
                      + Condition = {
                          + arn_like = {
                              + "ecs:cluster" = "arn:aws:ecs:ca-central-1:*:cluster/blazer"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "ECSTaskBlazerRead"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-d12df5fad74b8e69"
    }

  # aws_ssoadmin_permission_set_inline_policy.read_only_billing will be created
  + resource "aws_ssoadmin_permission_set_inline_policy" "read_only_billing" {
      + id                 = (known after apply)
      + inline_policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "billing:List*",
                          + "billing:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "BillingRead"
                    },
                  + {
                      + Action   = [
                          + "ce:List*",
                          + "ce:Get*",
                          + "ce:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CostExplorerRead"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c9084467f2ed3090"
    }

  # aws_ssoadmin_permission_set_inline_policy.remove_ses_sns_suppressed will be created
  + resource "aws_ssoadmin_permission_set_inline_policy" "remove_ses_sns_suppressed" {
      + id                 = (known after apply)
      + inline_policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:List*",
                          + "ses:Get*",
                          + "ses:DeleteSuppressedDestination",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SESReadAndDeleteSuppressed"
                    },
                  + {
                      + Action   = [
                          + "sns:OptInPhoneNumber",
                          + "sns:ListPhoneNumbersOptedOut",
                          + "sns:CheckIfPhoneNumberIsOptedOut",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SNSListAndDeleteOptedOutNumbers"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-7a9fcd184d647af8"
    }

Plan: 13 to add, 0 to change, 11 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.access_quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_pinpoint_sms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_s3_website_assets"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_support_center"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.notify_access_ecs_blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.read_only_billing"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
